# Практика #1
**Напишите программу, в которой будет продемонстрирована функциональность десяти любых методов класса String. В комментариях к программе напишите пояснение к используемым методам.**
```java
public class Main {
    public static void main(String[] args) {
        String str = "Java Programming";

        // 1. charAt(int index) — возвращает символ по указанному индексу.
        System.out.println("1. charAt: " + str.charAt(5)); // Вывод: P

        // 2. length() — возвращает длину строки.
        System.out.println("2. length: " + str.length()); // Вывод: 16

        // 3. substring(int beginIndex, int endIndex) — возвращает подстроку.
        System.out.println("3. substring: " + str.substring(5, 11)); // Вывод: Progra

        // 4. indexOf(String str) — возвращает индекс первого вхождения подстроки.
        System.out.println("4. indexOf: " + str.indexOf("Pro")); // Вывод: 5

        // 5. toUpperCase() — преобразует строку в верхний регистр.
        System.out.println("5. toUpperCase: " + str.toUpperCase()); // Вывод: JAVA PROGRAMMING

        // 6. toLowerCase() — преобразует строку в нижний регистр.
        System.out.println("6. toLowerCase: " + str.toLowerCase()); // Вывод: java programming

        // 7. replace(CharSequence target, CharSequence replacement) — заменяет все вхождения одной подстроки на другую.
        System.out.println("7. replace: " + str.replace("Java", "Kotlin")); // Вывод: Kotlin Programming

        // 8. trim() — удаляет начальные и конечные пробелы.
        String spacedStr = "  Hello World!  ";
        System.out.println("8. trim: '" + spacedStr.trim() + "'"); // Вывод: 'Hello World!'

        // 9. startsWith(String prefix) — проверяет, начинается ли строка с указанного префикса.
        System.out.println("9. startsWith: " + str.startsWith("Java")); // Вывод: true

        // 10. contains(CharSequence s) — проверяет, содержит ли строка указанную подстроку.
        System.out.println("10. contains: " + str.contains("gram")); // Вывод: true
    }
}

```

---

# Практика #2
**Приведите примеры использования класса StringJoiner.**
```java
import java.util.StringJoiner;

public class Main {
    public static void main(String[] args) {
        // Создание StringJoiner с разделителем ", "
        StringJoiner joiner = new StringJoiner(", ");

        // Добавление элементов
        joiner.add("Apple");
        joiner.add("Banana");
        joiner.add("Cherry");

        // Вывод соединенной строки
        System.out.println("1. Joiner without prefix and suffix: " + joiner); // Вывод: Apple, Banana, Cherry

        // StringJoiner с префиксом и суффиксом
        StringJoiner joinerWithPrefixSuffix = new StringJoiner(", ", "[", "]");
        joinerWithPrefixSuffix.add("Dog");
        joinerWithPrefixSuffix.add("Cat");

        System.out.println("2. Joiner with prefix and suffix: " + joinerWithPrefixSuffix); // Вывод: [Dog, Cat]

        // Добавление содержимого из одного StringJoiner в другой
        joiner.merge(joinerWithPrefixSuffix);
        System.out.println("3. Merged StringJoiner: " + joiner); // Вывод: Apple, Banana, Cherry, Dog, Cat
    }
}
```
---

# Практика #3
**Зачем нужны три двойные кавычки?**

Три двойные кавычки (""") используются для создания многострочных строк в некоторых языках программирования, например, Python или Kotlin, но в Java этого синтаксиса нет.

Для работы с многострочными строками в Java применяется метод String с разбиением строк:

```java
String multiLine = "This is line 1\n" +
                   "This is line 2\n" +
                   "This is line 3";
System.out.println(multiLine);
```
С выходом Java 15 появился новый функционал Text Blocks (многострочные строки):


```java
String textBlock = """
    This is line 1
    This is line 2
    This is line 3
    """;
System.out.println(textBlock);
```
**Почему удобны многострочные строки:**
- Уменьшается количество символов (+, \n).
- Улучшается читаемость кода.
- Подходит для форматирования больших текстов (SQL-запросы, HTML-разметка).