# Практика #1
**Напишите программу, в которой будет продемонстрирована функциональность десяти любых методов классов StringBuffer и StringBuilder. В комментариях к программе напишите пояснение к используемым методам.**

```java
public class Main {
    public static void main(String[] args) {
        // Используем StringBuffer
        StringBuffer buffer = new StringBuffer("Hello");
        
        // 1. append() - добавляет текст к строке
        buffer.append(" World");
        System.out.println("1. append: " + buffer); // Вывод: Hello World

        // 2. insert() - вставляет текст в указанную позицию
        buffer.insert(6, "Beautiful ");
        System.out.println("2. insert: " + buffer); // Вывод: Hello Beautiful World

        // 3. replace() - заменяет часть строки
        buffer.replace(6, 15, "Awesome");
        System.out.println("3. replace: " + buffer); // Вывод: Hello Awesome World

        // 4. delete() - удаляет часть строки
        buffer.delete(6, 13);
        System.out.println("4. delete: " + buffer); // Вывод: Hello World

        // 5. reverse() - переворачивает строку
        buffer.reverse();
        System.out.println("5. reverse: " + buffer); // Вывод: dlroW olleH

        // 6. length() - возвращает длину строки
        System.out.println("6. length: " + buffer.length()); // Вывод: 11

        // 7. charAt() - возвращает символ по индексу
        System.out.println("7. charAt: " + buffer.charAt(0)); // Вывод: d

        // Используем StringBuilder
        StringBuilder builder = new StringBuilder("Java");

        // 8. append() - добавляет текст к строке
        builder.append(" Programming");
        System.out.println("8. append: " + builder); // Вывод: Java Programming

        // 9. substring() - возвращает подстроку
        String substring = builder.substring(5, 15);
        System.out.println("9. substring: " + substring); // Вывод: Programming

        // 10. setCharAt() - заменяет символ по индексу
        builder.setCharAt(0, 'K');
        System.out.println("10. setCharAt: " + builder); // Вывод: Kava Programming
    }
}
```
---

# Практика #2
**Покажите с помощью каких методов объекты классов String, StringBuffer и StringBuilder могут быть преобразованы друг в друга.**

`StringBuffer` и `StringBuilder` можно инициализировать, передавая им объект `String` в конструкторе.
Методы `toString()` у `StringBuffer` и `StringBuilder` преобразуют их обратно в строку.
Для преобразования между `StringBuffer` и `StringBuilder` можно использовать соответствующие конструкторы.

```java
public class Main {
    public static void main(String[] args) {
        // Преобразование String -> StringBuffer
        String str = "Hello";
        StringBuffer stringBuffer = new StringBuffer(str);
        System.out.println("String -> StringBuffer: " + stringBuffer);

        // Преобразование StringBuffer -> String
        String stringFromBuffer = stringBuffer.toString();
        System.out.println("StringBuffer -> String: " + stringFromBuffer);

        // Преобразование String -> StringBuilder
        StringBuilder stringBuilder = new StringBuilder(str);
        System.out.println("String -> StringBuilder: " + stringBuilder);

        // Преобразование StringBuilder -> String
        String stringFromBuilder = stringBuilder.toString();
        System.out.println("StringBuilder -> String: " + stringFromBuilder);

        // Преобразование StringBuffer -> StringBuilder
        StringBuilder builderFromBuffer = new StringBuilder(stringBuffer);
        System.out.println("StringBuffer -> StringBuilder: " + builderFromBuffer);

        // Преобразование StringBuilder -> StringBuffer
        StringBuffer bufferFromBuilder = new StringBuffer(stringBuilder);
        System.out.println("StringBuilder -> StringBuffer: " + bufferFromBuilder);
    }
}
```
